modules/integration/tests-integration/src/test/resources/windows/enrollment/wstep.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ac="http://schemas.xmlsoap.org/ws/2006/12/authorization"> <s:Header> <a:Action s:mustUnderstand="1">http://schemas.microsoft.com/windows/pki/2009/01/enrollment/RST/wstep</a:Action> <a:MessageID>urn:uuid:0d5a1441-5891-453b-becf-a2e5f6ea3749</a:MessageID> <a:ReplyTo> <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address> </a:ReplyTo> <a:To s:mustUnderstand="1">https://EnterpriseEnrollment.qa.wso2teco.com/ENROLLMENTSERVER/DeviceEnrollmentWebservice.svc</a:To> <wsse:Security s:mustUnderstand="1"> <wsse:BinarySecurityToken ValueType="http://schemas.microsoft.com/5.0.0.0/ConfigurationManager/Enrollment/DeviceEnrollmentUserToken" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd#base64binary">{BinarySecurityToken}</wsse:BinarySecurityToken> </wsse:Security> </s:Header> <s:Body> <wst:RequestSecurityToken> <wst:TokenType>http://schemas.microsoft.com/5.0.0.0/ConfigurationManager/Enrollment/DeviceEnrollmentToken</wst:TokenType> <wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType> <wsse:BinarySecurityToken ValueType="http://schemas.microsoft.com/windows/pki/2009/01/enrollment#PKCS10" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd#base64binary">MIICcTCCAV0CAQAwMDEuMCwGA1UEAxMlQjFDNDNDRDAtMTYyNC01RkJCLThFNTQtMzRDRjE3REZEM0ExADCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMyBlGUhysOjd1iitHO7yFzQG9Jtxdm96mjiq5ckIpoEVGgyLQtLpQ8tU9zd4tLklL+B9ffDmUCcrz03rsO0UrptS+AUFrtyhdZOPWIvBY7iC+E1wsnsur3gVKXI1GXrYZJ/TJ+Nl9/77QSm5yMHTtfMs7sOiTZQeI9J7eTiwEtSg1hhJMhTQJz5flSRdVRgdaSi3Ydqucw/1eVdGgV9F5k86yM0hrQUHYg84R2vz30m+A4oG5FnDmCl1SlpfBybDIo1ffKfwoH/d0corAmiOXKXKhrxVjGQC8sq6kVcUzFyxpSCYAd39HDMMs2yK88RqJfOMy9d1JM+96ceI2neWtECAwEAAaAAMAkGBSsOAwIdBQADggEBAJZGXUmZv9exvi5Pg9kgeLBGeoADm46pTHAH8B68LqtmyZvx4iOm7nDzEQyO7P6rNmCb0rE2hYNH/uILqT6zMwVle1AstUZmYsryBzN3ptWWrhkD15PBKr1U4YbIPEdg8zXSuS7y+pq1dPd7nrh0Dxj1rRhyGfQRnzVoN7H22R8lyH5gJkH/MjZn4oVjRCYEsTLdELj8XKkHCw29h3fzTpnGjnI9P9mJQFgdaVmceXyO41O3GjY3WWyoH7MVUB6/N2tbzbnH8lgwA1sxe7P/MTbcYSf7Ic29zgddB1/w19R9ykzgdej6xbbgmCGwPO+dkFA4+YrxVjaTLo848DfYyF4=</wsse:BinarySecurityToken> <ac:AdditionalContext xmlns="http://schemas.xmlsoap.org/ws/2006/12/authorization"> <ac:ContextItem Name="DeviceType"> <ac:Value>WindowsPhone</ac:Value> </ac:ContextItem> <ac:ContextItem Name="ApplicationVersion"> <ac:Value>8.10.12397.895</ac:Value> </ac:ContextItem> </ac:AdditionalContext> </wst:RequestSecurityToken> </s:Body> </s:Envelope>